BG6UD/uv-k1-k5v3_py32f071_firmware_for_DTrac/App/app/uart.c
            SendVersion(Port);
        }

        gUpdateDisplay = true;
    }
}

// for DTrac app upFreq
static void CMD_7777(const uint8_t *pBuffer)
{
    const CMD_7777_t *pCmd = (const CMD_7777_t *)pBuffer;
    uint32_t upFrequency = pCmd->UpFrequency / 10;
    if (gRxVfo->pTX->Frequency != upFrequency)
    {
        gRxVfo->pTX->Frequency = upFrequency;

        if (gPttIsPressed)
        {
            BK4819_PickRXFilterPathBasedOnFrequency(upFrequency);
            BK4819_SetFrequency(upFrequency);

            uint16_t reg30 = BK4819_ReadRegister(BK4819_REG_30);

            // VCO Calibration bit 15 0x8000
            BK4819_WriteRegister(BK4819_REG_30, reg30 | 0x8000);
            SYSTICK_DelayUs(100);
            BK4819_WriteRegister(BK4819_REG_30, reg30);

            SYSTICK_DelayUs(1500);
        }

        gUpdateDisplay = true;
    }
}

// for DTrac app mode
static void CMD_6666(const uint8_t *pBuffer)
{
    const CMD_6666_t *pCmd = (const CMD_6666_t *)pBuffer;
    // char mode = pCmd->Mode;
    uint8_t mode;
    switch (pCmd->Mode)
    {
    case 'F':
        mode = MODULATION_FM;
        break;
    case 'A':
        mode = MODULATION_AM;
        break;
    case 'U':
        mode = MODULATION_USB;
        break;
#ifdef ENABLE_BYP_RAW_DEMODULATORS
    case 'B':
        mode = MODULATION_BYP;
        break;
    case 'R':
        mode = MODULATION_RAW;
        break;
#endif
    default:
        mode = MODULATION_FM;
        break;
    }
    if (gRxVfo->Modulation != mode)
    {
        gRxVfo->Modulation = mode;
        RADIO_SetModulation(mode);
    }

    gUpdateDisplay = true;
}

// for DTrac app MONITOR
char lastMonitorStatus = 'U';
static void CMD_5555(const uint8_t *pBuffer)
{
    const CMD_5555_t *pCmd = (const CMD_5555_t *)pBuffer;

    if (lastMonitorStatus != pCmd->MonitorStatus)
    {
        switch (pCmd->MonitorStatus)
        {
        case 'Y':
            RADIO_SetupRegisters(true);
            APP_StartListening(FUNCTION_MONITOR);
            break;
        case 'N':
            RADIO_SetupRegisters(true);
            APP_StartListening(FUNCTION_RECEIVE);
            break;
        }
        lastMonitorStatus = pCmd->MonitorStatus;
    }
}

#endif

#ifdef ENABLE_EXTRA_UART_CMD
// read RSSI
static void CMD_0527(uint32_t Port)
{
    REPLY_0527_t Reply;

    Reply.Header.ID = 0x0528;
    Reply.Header.Size = sizeof(Reply.Data);
    Reply.Data.RSSI = BK4819_ReadRegister(BK4819_REG_67) & 0x01FF;
    Reply.Data.ExNoiseIndicator = BK4819_ReadRegister(BK4819_REG_65) & 0x007F;
    Reply.Data.GlitchIndicator = BK4819_ReadRegister(BK4819_REG_63);

    SendReply(Port, &Reply, sizeof(Reply));
}

// read ADC
static void CMD_0529(uint32_t Port)
{
    REPLY_0529_t Reply;

    Reply.Header.ID = 0x52A;
    Reply.Header.Size = sizeof(Reply.Data);

    // Original doesn't actually send current!
    BOARD_ADC_GetBatteryInfo(&Reply.Data.Voltage, &Reply.Data.Current);

    SendReply(Port, &Reply, sizeof(Reply));
}

#ifndef ENABLE_FEAT_F4HWN
static void CMD_052D(uint32_t Port, const uint8_t *pBuffer)
{
    const CMD_052D_t *pCmd = (const CMD_052D_t *)pBuffer;
    REPLY_052D_t Reply;
    bool bIsLocked;

#ifdef ENABLE_FMRADIO_EMBEDDED
    gFmRadioCountdown_500ms = fm_radio_countdown_500ms;
#endif
    Reply.Header.ID = 0x052E;
    Reply.Header.Size = sizeof(Reply.Data);

    bIsLocked = bHasCustomAesKey;

    if (!bIsLocked)
        bIsLocked = IsBadChallenge(gCustomAesKey, gChallenge, pCmd->Response);

    if (!bIsLocked)
    {
        bIsLocked = IsBadChallenge(gDefaultAesKey, gChallenge, pCmd->Response);
        if (bIsLocked)
            gTryCount++;
    }

    if (gTryCount < 3)
    {
        if (!bIsLocked)
            gTryCount = 0;
    }
    else
    {
        gTryCount = 3;
        bIsLocked = true;
    }

    gIsLocked = bIsLocked;
    Reply.Data.bIsLocked = bIsLocked;
    Reply.Data.Padding[0] = Reply.Data.Padding[1] = Reply.Data.Padding[2] = 0;

    SendReply(Port, &Reply, sizeof(Reply));
}
#endif

// session init, sends back version info and state
// timestamp is a session id really
// this command also disables dual watch, crossband,
// DTMF side tones, freq reverse, PTT ID, DTMF decoding, frequency offset
// exits power save, sets main VFO to upper,
static void CMD_052F(uint32_t Port, const uint8_t *pBuffer)
{
    const CMD_052F_t *pCmd = (const CMD_052F_t *)pBuffer;

    gEeprom.DUAL_WATCH = DUAL_WATCH_OFF;
    gEeprom.CROSS_BAND_RX_TX = CROSS_BAND_OFF;
    gEeprom.RX_VFO = 0;
    gEeprom.DTMF_SIDE_TONE = false;
    gEeprom.VfoInfo[0].FrequencyReverse = false;
    gEeprom.VfoInfo[0].pRX = &gEeprom.VfoInfo[0].freq_config_RX;
    gEeprom.VfoInfo[0].pTX = &gEeprom.VfoInfo[0].freq_config_TX;
    gEeprom.VfoInfo[0].TX_OFFSET_FREQUENCY_DIRECTION = TX_OFFSET_FREQUENCY_DIRECTION_OFF;
    gEeprom.VfoInfo[0].DTMF_PTT_ID_TX_MODE = PTT_ID_OFF;
#ifdef ENABLE_DTMF_CALLING
    gEeprom.VfoInfo[0].DTMF_DECODING_ENABLE = false;
#endif

#ifdef ENABLE_NOAA
    gIsNoaaMode = false;
#endif

    if (gCurrentFunction == FUNCTION_POWER_SAVE)
        FUNCTION_Select(FUNCTION_FOREGROUND);

    gSerialConfigCountDown_500ms = 12; // 6 sec

    if (0)
    {
    }
#if defined(ENABLE_UART)
    else if (Port == UART_PORT_UART)
    {
        UART_Timestamp = pCmd->Timestamp;
    }
#endif
#if defined(ENABLE_USB)
    else if (Port == UART_PORT_VCP)
    {
        VCP_Timestamp = pCmd->Timestamp;
    }
#endif

    // Backlight left untouched: a serial session is neutral, so the normal BLTime
    // inactivity countdown keeps running from the last keypress (no forced turn-off).

    SendVersion(Port);
}
#endif

#ifdef ENABLE_UART_RW_BK_REGS
static void CMD_0601_ReadBK4819Reg(uint32_t Port, const uint8_t *pBuffer)
{
    typedef struct __attribute__((__packed__))
    {
        Header_t header;
        uint8_t reg;
    } CMD_0601_t;

    CMD_0601_t *cmd = (CMD_0601_t *)pBuffer;

    struct __attribute__((__packed__))
    {
        Header_t header;
        struct __attribute__((__packed__))
        {
            uint8_t reg;
            uint16_t value;
        } data;
    } reply;

    reply.header.ID = 0x0601;
    reply.header.Size = sizeof(reply.data);
    reply.data.reg = cmd->reg;
    reply.data.value = BK4819_ReadRegister(cmd->reg);
    SendReply(Port, &reply, sizeof(reply));
}

static void CMD_0602_WriteBK4819Reg(const uint8_t *pBuffer)
{
    typedef struct __attribute__((__packed__))
    {
        Header_t header;
        uint8_t reg;
        uint16_t value;
    } CMD_0602_t;

    CMD_0602_t *cmd = (CMD_0602_t *)pBuffer;
    BK4819_WriteRegister(cmd->reg, cmd->value);
}
#endif

bool UART_IsCommandAvailable(uint32_t Port)
{
    uint16_t Index;
    uint16_t TailIndex;
    uint16_t Size;
    uint16_t Crc;
    uint16_t CommandLength;
    uint16_t DmaLength;
    uint8_t *ReadBuf;
    uint16_t ReadBufSize;
    uint16_t *pReadPointer;
    UART_Command_t *pUART_Command;

    if (0)
    {
    }
#if defined(ENABLE_UART)
    else if (Port == UART_PORT_UART)
    {
        DmaLength = sizeof(UART_DMA_Buffer) - LL_DMA_GetDataLength(DMA1, DMA_CHANNEL);
        ReadBuf = UART_DMA_Buffer;
        ReadBufSize = sizeof(UART_DMA_Buffer);
        pReadPointer = &gUART_WriteIndex;
        pUART_Command = &UART_Command;
    }
#endif
#if defined(ENABLE_USB)
    else if (Port == UART_PORT_VCP)
    {
        DmaLength = VCP_RxBufPointer;
        ReadBuf = VCP_RxBuf;
        ReadBufSize = sizeof(VCP_RxBuf);
        pReadPointer = &VCP_ReadIndex;
        pUART_Command = &VCP_Command;
    }
#endif
    else
    {
        return false;
    }

