BG6UD/uv-k1-k5v3_py32f071_firmware_for_DTrac/App/app/uart.c
    case 0x0722: // slot erase: wipe the whole 128 KiB slot region
    {
        if (pUART_Command->Header.Size < 6u)
            break;                         // needs Data[0] slot + Data[2..5] timestamp
        gSerialConfigCountDown_500ms = 12; // keep serial mode alive (6 s)
        uint8_t slot = pUART_Command->Data[0];
        uint32_t ts = (uint32_t)pUART_Command->Data[2] | ((uint32_t)pUART_Command->Data[3] << 8) | ((uint32_t)pUART_Command->Data[4] << 16) | ((uint32_t)pUART_Command->Data[5] << 24);
        uint8_t status = (ts != mb_port_timestamp(Port))
                             ? MB_ERR_AUTH
                             : MB_SlotErase(slot);
        struct __attribute__((packed))
        {
            Header_t Header;
            uint8_t Slot;
            uint8_t Status;
        } Reply;
        Reply.Header.ID = 0x0723;
        Reply.Header.Size = 2;
        Reply.Slot = slot;
        Reply.Status = status;
        SendReply(Port, &Reply, sizeof(Reply));
        break;
    }

    case 0x0724: // slot write: program bytes at slot+offset (slot pre-erased)
    {
        if (pUART_Command->Header.Size < 12u)
            break;
        gSerialConfigCountDown_500ms = 12; // keep serial mode alive (6 s)
        uint8_t slot = pUART_Command->Data[0];
        uint32_t offset = (uint32_t)pUART_Command->Data[2] | ((uint32_t)pUART_Command->Data[3] << 8) | ((uint32_t)pUART_Command->Data[4] << 16) | ((uint32_t)pUART_Command->Data[5] << 24);
        uint16_t len = (uint16_t)(pUART_Command->Data[6] | ((uint16_t)pUART_Command->Data[7] << 8));
        uint32_t ts = (uint32_t)pUART_Command->Data[8] | ((uint32_t)pUART_Command->Data[9] << 8) | ((uint32_t)pUART_Command->Data[10] << 16) | ((uint32_t)pUART_Command->Data[11] << 24);
        uint8_t status;
        if (ts != mb_port_timestamp(Port))
            status = MB_ERR_AUTH;
        else if (len > pUART_Command->Header.Size - 12u)
            status = MB_ERR_SIZE;
        else
            status = MB_SlotWrite(slot, offset, &pUART_Command->Data[12], len);
        struct __attribute__((packed))
        {
            Header_t Header;
            uint8_t Slot;
            uint8_t Status;
        } Reply;
        Reply.Header.ID = 0x0725;
        Reply.Header.Size = 2;
        Reply.Slot = slot;
        Reply.Status = status;
        SendReply(Port, &Reply, sizeof(Reply));
        break;
    }

    case 0x0726: // slot validate: full image CRC-32, no reflash
    {
        if (pUART_Command->Header.Size < 1u)
            break;                         // needs Data[0] (slot)
        gSerialConfigCountDown_500ms = 12; // keep serial mode alive (6 s)
        uint8_t slot = pUART_Command->Data[0];
        uint32_t crc = 0;
        uint8_t status = MB_ValidateSlot(slot, NULL, &crc);
        struct __attribute__((packed))
        {
            Header_t Header;
            uint32_t Crc32; // offset 4: 4-byte aligned, no unaligned store
            uint8_t Slot;
            uint8_t Status;
        } Reply;
        Reply.Header.ID = 0x0727;
        Reply.Header.Size = 6;
        Reply.Crc32 = crc;
        Reply.Slot = slot;
        Reply.Status = status;
        SendReply(Port, &Reply, sizeof(Reply));
        break;
    }

    case 0x0728: // config reset: wipe the 64 KiB of a config bank (1..4)
    {
        if (pUART_Command->Header.Size < 6u)
            break;                         // needs Data[0] bank + Data[2..5] timestamp
        gSerialConfigCountDown_500ms = 12; // keep serial mode alive (6 s)
        uint8_t bank = pUART_Command->Data[0];
        uint32_t ts = (uint32_t)pUART_Command->Data[2] | ((uint32_t)pUART_Command->Data[3] << 8) | ((uint32_t)pUART_Command->Data[4] << 16) | ((uint32_t)pUART_Command->Data[5] << 24);
        uint8_t status = (ts != mb_port_timestamp(Port))
                             ? MB_ERR_AUTH
                             : MB_BankErase(bank);
        struct __attribute__((packed))
        {
            Header_t Header;
            uint8_t Bank; // echoes the erased bank (same wire layout as slot replies)
            uint8_t Status;
        } Reply;
        Reply.Header.ID = 0x0729;
        Reply.Header.Size = 2;
        Reply.Bank = bank;
        Reply.Status = status;
        SendReply(Port, &Reply, sizeof(Reply));
        break;
    }
#endif

#ifdef ENABLE_FEAT_F4HWN_OVERLAY_APPS
    // ---- overlay-app slot management ("Apps") -------------------------
    // Parallels the firmware-slot family (0x072x); targets the external-flash
    // Apps region. External flash only, never brick-critical.
    case 0x0730: // app slot info: read the 64-byte header only
    {
        if (pUART_Command->Header.Size < 1u)
            break;                         // needs Data[0] (slot)
        gSerialConfigCountDown_500ms = 12; // keep serial mode alive (6 s)
        uint8_t slot = pUART_Command->Data[0];
        app_header_t hdr;
        memset(&hdr, 0, sizeof(hdr));
        uint8_t status = APP_SlotInfo(slot, &hdr);
        struct __attribute__((packed))
        {
            Header_t Header;
            uint8_t Slot;
            uint8_t Status;
            uint8_t Hdr[sizeof(app_header_t)];
        } Reply;
        Reply.Header.ID = 0x0731;
        Reply.Header.Size = 2 + sizeof(app_header_t);
        Reply.Slot = slot;
        Reply.Status = status;
        memcpy(Reply.Hdr, &hdr, sizeof(hdr));
        SendReply(Port, &Reply, sizeof(Reply));
        break;
    }

    case 0x0732: // app slot erase: wipe the whole 8 KiB slot region
    {
        if (pUART_Command->Header.Size < 6u)
            break;                         // needs Data[0] slot + Data[2..5] timestamp
        gSerialConfigCountDown_500ms = 12; // keep serial mode alive (6 s)
        uint8_t slot = pUART_Command->Data[0];
        uint32_t ts = (uint32_t)pUART_Command->Data[2] | ((uint32_t)pUART_Command->Data[3] << 8) | ((uint32_t)pUART_Command->Data[4] << 16) | ((uint32_t)pUART_Command->Data[5] << 24);
        uint8_t status = (ts != mb_port_timestamp(Port))
                             ? APP_ERR_AUTH
                             : APP_SlotErase(slot);
        struct __attribute__((packed))
        {
            Header_t Header;
            uint8_t Slot;
            uint8_t Status;
        } Reply;
        Reply.Header.ID = 0x0733;
        Reply.Header.Size = 2;
        Reply.Slot = slot;
        Reply.Status = status;
        SendReply(Port, &Reply, sizeof(Reply));
        break;
    }

    case 0x0734: // app slot write: program bytes at slot+offset (pre-erased)
    {
        if (pUART_Command->Header.Size < 12u)
            break;
        gSerialConfigCountDown_500ms = 12; // keep serial mode alive (6 s)
        uint8_t slot = pUART_Command->Data[0];
        uint32_t offset = (uint32_t)pUART_Command->Data[2] | ((uint32_t)pUART_Command->Data[3] << 8) | ((uint32_t)pUART_Command->Data[4] << 16) | ((uint32_t)pUART_Command->Data[5] << 24);
        uint16_t len = (uint16_t)(pUART_Command->Data[6] | ((uint16_t)pUART_Command->Data[7] << 8));
        uint32_t ts = (uint32_t)pUART_Command->Data[8] | ((uint32_t)pUART_Command->Data[9] << 8) | ((uint32_t)pUART_Command->Data[10] << 16) | ((uint32_t)pUART_Command->Data[11] << 24);
        uint8_t status;
        if (ts != mb_port_timestamp(Port))
            status = APP_ERR_AUTH;
        else if (len > pUART_Command->Header.Size - 12u)
            status = APP_ERR_SIZE;
        else
            status = APP_SlotWrite(slot, offset, &pUART_Command->Data[12], len);
        struct __attribute__((packed))
        {
            Header_t Header;
            uint8_t Slot;
            uint8_t Status;
        } Reply;
        Reply.Header.ID = 0x0735;
        Reply.Header.Size = 2;
        Reply.Slot = slot;
        Reply.Status = status;
        SendReply(Port, &Reply, sizeof(Reply));
        break;
    }

    case 0x0736: // app slot validate: header only (code CRC is checked at launch)
    {
        if (pUART_Command->Header.Size < 1u)
            break;                         // needs Data[0] (slot)
        gSerialConfigCountDown_500ms = 12; // keep serial mode alive (6 s)
        uint8_t slot = pUART_Command->Data[0];
        uint8_t status = APP_ValidateSlot(slot, NULL);
        struct __attribute__((packed))
        {
            Header_t Header;
            uint8_t Slot;
            uint8_t Status;
        } Reply;
        Reply.Header.ID = 0x0737;
        Reply.Header.Size = 2;
        Reply.Slot = slot;
        Reply.Status = status;
        SendReply(Port, &Reply, sizeof(Reply));
        break;
    }
#endif

#ifdef ENABLE_UART_RW_BK_REGS
    case 0x0601:
        CMD_0601_ReadBK4819Reg(Port, pUART_Command->Buffer);
        break;

    case 0x0602:
        CMD_0602_WriteBK4819Reg(pUART_Command->Buffer);
        break;
#endif
    } // switch

#ifdef ENABLE_FEAT_F4HWN_K5VIEWER
    gUART_LockK5Viewer = 20; // lock the K5Viewer stream
#endif
}

void UART_ServiceCommands(void)
{
#ifdef ENABLE_USB
    if (UART_IsCommandAvailable(UART_PORT_VCP))
        UART_HandleCommand(UART_PORT_VCP);
#endif

#ifdef ENABLE_UART
    if (UART_IsCommandAvailable(UART_PORT_UART))
        UART_HandleCommand(UART_PORT_UART);
#endif
}
